/*
 * برنامج مراقبة جهد الشبكة العامة للكهرباء
 * اعداد:عبدالرحمن الأزهري
 * اشراف:أ.علاء القيب
 * الاصدار: 1.2.0
 * 
 * 
 */

long readVcc();                    // دالة تقرأ جهد التغذية على شكل ملي فولي

void setup() {  
  Serial.begin(9600);                // تجهيز المنفذ التسلسلي
}

void loop() {

  if (Serial.available() > 0){      // هل يوجد اي اوامر
    char cmd = Serial.read();        // اقرا الامر
    if (cmd == 'v' | cmd == 'V'){
      double Vcc = readVcc() / 1000.0;               //  اقرأ جهد التغذية (فولت)
      double ratio = Vcc / 5.0;    // قارن جهد التغذية بقيمة 5 فولت
      int adc = analogRead(6);     // اقرأ جهد الدخل من دائرة تخفيض الجهد ( 0 - 1023)
      double vin = ratio * adc;     // عدل قيمة جهد الدخل ليصبح ذو مرجعية للجهد 5 فولت (0 - 1023)
      Serial.println(vin);          // ارسل قيمة جهد الدخل عبر المنفذ التسلسلي
    }
  }
  delay(500);
}

